Tekla Open API Reference for Tekla Structures 2025
PolygonAttributes Constructor
Overload List
Name | Description
Polygon.PolygonAttributes()
 Creates a new default polygon attributes instance that loads standard attributes.
Polygon.PolygonAttributes(String)
 Creates a new polygon attributes instance that loads the specified attributes.
Top
See Also
Reference
Polygon.PolygonAttributes Class
Tekla.Structures.Drawing Namespace